## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_cloudfront_function.web_response will be destroyed
  # (because aws_cloudfront_function.web_response is not in configuration)
-   resource "aws_cloudfront_function" "web_response" {
-       arn             = "arn:aws:cloudfront::357150818708:function/cpfreporter-cpf_reporter_web_response" -> null
-       code            = <<-EOT
            function handler(event) {
              var response = event.response;
              response.headers = Object.assign({}, {
              "x-frame-options": {
                  "value": "SAMEORIGIN"
              },
              "x-content-type-options": {
                  "value": "nosniff"
              },
              "x-xss-protection": {
                  "value": "1; mode=block"
              },
              "strict-transport-security": {
                  "value": "max-age=63072000"
              }
            }, response.headers);
              return response;
            }
        EOT -> null
-       comment         = "CPF Reporter web response." -> null
-       etag            = "E3UN6WX5RRO2AG" -> null
-       id              = "cpfreporter-cpf_reporter_web_response" -> null
-       live_stage_etag = "E3UN6WX5RRO2AG" -> null
-       name            = "cpfreporter-cpf_reporter_web_response" -> null
-       publish         = true -> null
-       runtime         = "cloudfront-js-1.0" -> null
-       status          = "DEPLOYED" -> null
    }

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:14" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
-       tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cc6e1c2d372e53666bb6a27d56d23020-6" -> "7b7fb386917e73c664c25458e2025961"
      ~ id                     = "graphql.c19ed0e22706ec44e64783b937281431.zip" -> (known after apply)
      ~ key                    = "graphql.c19ed0e22706ec44e64783b937281431.zip" -> "graphql.7b7fb386917e73c664c25458e2025961.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "c19ed0e22706ec44e64783b937281431" -> "7b7fb386917e73c664c25458e2025961"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "S4jqDm0MgwFzd8ODS_K5K4lWYyVUTdXK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "84a142a7ebcb522b06614e83ed311152" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/200.html"
      ~ source_hash            = "84a142a7ebcb522b06614e83ed311152" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "T86qloLObk4RBUjiVEeDZK9s1Rs2Jnw7" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "dbc8fa431f5b23ddb1b7c82042d7dd48" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "dbc8fa431f5b23ddb1b7c82042d7dd48" -> "8f5c9178fa80f14d15cd3a32f819dbee"
        tags                   = {}
      ~ version_id             = "MCX1Es2kMpe619w9UGZ5S5IL53sVsKki" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b6a5bc0c84ea3245f1531adccc9fed29" -> "54f38202789932549d203cfac8d15867"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "b6a5bc0c84ea3245f1531adccc9fed29" -> "54f38202789932549d203cfac8d15867"
        tags                   = {}
      ~ version_id             = "H6jZwBT4ahzXP7Sh8w2KH4YB.Hw4zF.B" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "84a142a7ebcb522b06614e83ed311152" -> "1310e8797d11fa22899d647f10403899"
        id                     = "dist/index.html"
      ~ source_hash            = "84a142a7ebcb522b06614e83ed311152" -> "1310e8797d11fa22899d647f10403899"
        tags                   = {}
      ~ version_id             = "PtZbl7tAFV3_E70FV9lZj.4hgKLbbgvf" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "dd42626cf22d4c58fc5e205928b29a40"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js"
+       source_hash            = "dd42626cf22d4c58fc5e205928b29a40"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.74432613.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.74432613.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.74432613.js.LICENSE.txt"
+       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.d76112ce.js"] will be destroyed
  # (because key ["static/js/app.d76112ce.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c0f17e6661c69010d85da4ee4c63c2d3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.d76112ce.js" -> null
-       key                    = "dist/static/js/app.d76112ce.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.d76112ce.js" -> null
-       source_hash            = "c0f17e6661c69010d85da4ee4c63c2d3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "IxP8..4R2RfR1nC4bdRCrKw6jPszZSR9" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.d76112ce.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.d76112ce.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.d76112ce.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.d76112ce.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.d76112ce.js.LICENSE.txt" -> null
-       source_hash            = "8d0c60a3ca38489c1bb3fd646469d4db" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "GM5ptxo4v5PQDBwEGczqeRD_ChJXdY4z" -> null
    }

  # module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E10LD7TGHC4SRE"
        tags                           = {}
        # (21 unchanged attributes hidden)

-       custom_error_response {
-           error_caching_min_ttl = 0 -> null
-           error_code            = 404 -> null
-           response_code         = 200 -> null
-           response_page_path    = "/index.html" -> null
        }
+       custom_error_response {
+           error_code         = 403
+           response_code      = 403
+           response_page_path = "/errors/403.html"
        }
+       custom_error_response {
+           error_code         = 404
+           response_code      = 404
+           response_page_path = "/errors/404.html"
        }

      ~ default_cache_behavior {
            # (12 unchanged attributes hidden)

-           function_association {
-               event_type   = "viewer-response" -> null
-               function_arn = "arn:aws:cloudfront::357150818708:function/cpfreporter-cpf_reporter_web_response" -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2023-12-10T14:35:46.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:32" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:32/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.c19ed0e22706ec44e64783b937281431.zip" -> "graphql.7b7fb386917e73c664c25458e2025961.zip"
        tags                           = {}
      ~ version                        = "32" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "2ede4b87e477fc36d2ccba7c0edccdf425610535" -> "2d5436b4b9693f2b36c6a749b60ffb00a101578e"
              ~ "DD_TAGS"                            = "git.commit.sha:2ede4b87e477fc36d2ccba7c0edccdf425610535,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2d5436b4b9693f2b36c6a749b60ffb00a101578e,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "2ede4b87e477fc36d2ccba7c0edccdf425610535" -> "2d5436b4b9693f2b36c6a749b60ffb00a101578e"
                # (15 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "32" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 5 to add, 7 to change, 6 to destroy.
```

</details>

*Pusher: @Vikariusu, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/7160944010)*